; domain
(define (domain emergency-logistics-transporters)
  (:requirements :strips :typing :action-costs :fluents)

  (:types
    drone location person box content transporter num - object
  )

  (:predicates
    ;; Posiciones
    (at-drone ?d - drone ?l - location)
    (at-person ?p - person ?l - location)
    (at-box ?c - box ?l - location)
    (at-transporter ?tr - transporter ?l - location)

    ;; Dron con un único brazo
    (arm-free ?d - drone)
    (holding ?d - drone ?c - box)

    ;; Caja dentro del transportador 
    (box-in ?c - box ?tr - transporter)

    ;; Contenido
    (box-has ?c - box ?t - content)
    (full-box ?c - box)
    (person-has ?p - person ?t - content)

    ;; "Números" con objetos
    (siguiente ?a ?b - num)          
    (free-slots ?tr - transporter ?n - num) 
  )

  (:functions
    (total-cost)
    (fly-cost ?from ?to - location)
  )


  ;; Movimientos

  ;; borrar fly para ejecutar problemas.
  (:action fly
    :parameters (?d - drone ?from - location ?to - location)
    :precondition (at-drone ?d ?from)
    :effect (and
      (not (at-drone ?d ?from))
      (at-drone ?d ?to)
      (increase (total-cost) (fly-cost ?from ?to))
    )
  )

  (:action fly-with-transporter
    :parameters (?d - drone ?tr - transporter ?from - location ?to - location)
    :precondition (and
      (at-drone ?d ?from)
      (at-transporter ?tr ?from)
      (arm-free ?d)
    )
    :effect (and
      (not (at-drone ?d ?from))
      (at-drone ?d ?to)
      (not (at-transporter ?tr ?from))
      (at-transporter ?tr ?to)
      (increase (total-cost) (fly-cost ?from ?to))
    )
  )

 
  (:action pick-box
    :parameters (?d - drone ?c - box ?l - location)
    :precondition (and
      (at-drone ?d ?l)
      (at-box ?c ?l)
      (arm-free ?d)
      (full-box ?c)
    )
    :effect (and
      (holding ?d ?c)
      (not (arm-free ?d))
      (not (at-box ?c ?l))
      (increase (total-cost) 1)
    )
  )

  (:action put-box-in-transporter
    :parameters (?d - drone ?tr - transporter ?c - box ?l - location ?nPrev ?n - num)
    :precondition (and
      (at-drone ?d ?l)
      (at-transporter ?tr ?l)
      (holding ?d ?c)
      (free-slots ?tr ?n)
      (siguiente ?nPrev ?n)
    )
    :effect (and
      (box-in ?c ?tr)
      (not (holding ?d ?c))
      (arm-free ?d)
      (not (free-slots ?tr ?n))
      (free-slots ?tr ?nPrev)
      (increase (total-cost) 1)
    )
  )


  (:action take-box-from-transporter
    :parameters (?d - drone ?tr - transporter ?c - box ?l - location ?n ?nNext - num)
    :precondition (and
      (at-drone ?d ?l)
      (at-transporter ?tr ?l)
      (box-in ?c ?tr)
      (arm-free ?d)
      (free-slots ?tr ?n)
      (siguiente ?n ?nNext)
    )
    :effect (and
      (holding ?d ?c)
      (not (arm-free ?d))
      (not (box-in ?c ?tr))
      (not (free-slots ?tr ?n))
      (free-slots ?tr ?nNext)
      (increase (total-cost) 1)
    )
  )

  (:action deliver
    :parameters (?d - drone ?c - box ?p - person ?l - location ?t - content)
    :precondition (and
      (at-drone ?d ?l)
      (at-person ?p ?l)
      (holding ?d ?c)
      (box-has ?c ?t)
    )
    :effect (and
      (person-has ?p ?t)
      (at-box ?c ?l)
      (arm-free ?d)
      (not (holding ?d ?c))
      (not (full-box ?c))
      (increase (total-cost) 1)
    )
  )
)

; problem
(define (problem drone_problem_d1_t1_l3_p3_c5_g3_s2_ct2)
(:domain emergency-logistics-transporters)
(:objects
	drone1 - drone
	depot - location
	loc1 - location
	loc2 - location
	loc3 - location
	person1 - person
	person2 - person
	person3 - person
	box1 - box
	box2 - box
	box3 - box
	box4 - box
	box5 - box
	food - content
	medicine - content
	transporter1 - transporter
	n0 - num
	n1 - num
	n2 - num
)
(:init
	(= (total-cost) 0)
	(= (fly-cost depot loc1) 197)
	(= (fly-cost depot loc2) 216)
	(= (fly-cost depot loc3) 125)
	(= (fly-cost loc1 depot) 197)
	(= (fly-cost loc1 loc2) 20)
	(= (fly-cost loc1 loc3) 157)
	(= (fly-cost loc2 depot) 216)
	(= (fly-cost loc2 loc1) 20)
	(= (fly-cost loc2 loc3) 170)
	(= (fly-cost loc3 depot) 125)
	(= (fly-cost loc3 loc1) 157)
	(= (fly-cost loc3 loc2) 170)
	(at-drone drone1 depot)
	(arm-free drone1)
	(at-transporter transporter1 depot)
	(free-slots transporter1 n2)
	(siguiente n0 n1)
	(siguiente n1 n2)
	(at-person person1 loc1)
	(at-person person2 loc2)
	(at-person person3 loc3)
	(at-box box1 depot)
	(box-has box1 food)
	(full-box box1)
	(at-box box2 depot)
	(box-has box2 medicine)
	(full-box box2)
	(at-box box3 depot)
	(box-has box3 medicine)
	(full-box box3)
	(at-box box4 depot)
	(box-has box4 medicine)
	(full-box box4)
	(at-box box5 depot)
	(box-has box5 medicine)
	(full-box box5)
)
(:goal (and
	(at-drone drone1 depot)
	(person-has person1 medicine)
	(person-has person2 food)
	(person-has person3 medicine)
	))
(:metric minimize (total-cost))
)

; plan
1. (pick-box drone1 box1 depot)
   deleted: (arm-free drone1) (at-box box1 depot)
   added: (holding drone1 box1)
   goals met: 1 of 4
2. (fly drone1 depot loc2)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc2)
   goals met: 0 of 4
3. (deliver drone1 box1 person2 loc2 food)
   deleted: (holding drone1 box1) (full-box box1)
   added: (person-has person2 food) (at-box box1 loc2) (arm-free drone1)
   goals met: 1 of 4
4. (fly drone1 loc2 loc1)
   deleted: (at-drone drone1 loc2)
   added: (at-drone drone1 loc1)
   goals met: 1 of 4
5. (fly drone1 loc1 depot)
   deleted: (at-drone drone1 loc1)
   added: (at-drone drone1 depot)
   goals met: 2 of 4
6. (pick-box drone1 box5 depot)
   deleted: (arm-free drone1) (at-box box5 depot)
   added: (holding drone1 box5)
   goals met: 2 of 4
7. (fly drone1 depot loc1)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc1)
   goals met: 1 of 4
8. (deliver drone1 box5 person1 loc1 medicine)
   deleted: (holding drone1 box5) (full-box box5)
   added: (person-has person1 medicine) (at-box box5 loc1) (arm-free drone1)
   goals met: 2 of 4
9. (fly drone1 loc1 loc3)
   deleted: (at-drone drone1 loc1)
   added: (at-drone drone1 loc3)
   goals met: 2 of 4
10. (fly drone1 loc3 depot)
   deleted: (at-drone drone1 loc3)
   added: (at-drone drone1 depot)
   goals met: 3 of 4
11. (pick-box drone1 box4 depot)
   deleted: (arm-free drone1) (at-box box4 depot)
   added: (holding drone1 box4)
   goals met: 3 of 4
12. (fly drone1 depot loc3)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc3)
   goals met: 2 of 4
13. (deliver drone1 box4 person3 loc3 medicine)
   deleted: (holding drone1 box4) (full-box box4)
   added: (person-has person3 medicine) (at-box box4 loc3) (arm-free drone1)
   goals met: 3 of 4
14. (fly drone1 loc3 depot)
   deleted: (at-drone drone1 loc3)
   added: (at-drone drone1 depot)
   goals met: 4 of 4
